Revit 2027 API
ReloadSwapOutInfo.WasSwapped Property
 Whether the swap out was successful.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WasSwapped { get; }
Public ReadOnly Property WasSwapped As Boolean
	Get
public:
property bool WasSwapped {
	bool get ();
}
member WasSwapped : bool with get
Property Value
Boolean
See Also
Reference
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace